Tekla Open API Reference for Tekla Structures 2025
LogicalWeld.Select Method (BaseWeld)
 Selects the logical weld that a child weld belongs to.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Select(
	BaseWeld ChildWeld
)
Public Function Select (
	ChildWeld As BaseWeld
) As Boolean
Parameters
ChildWeld
Type: Tekla.Structures.Model.BaseWeld
A child weld whose logical weld we want to select.
Return Value
Type: Boolean
True on success.
See Also
Reference
LogicalWeld Class
Select Overload
Tekla.Structures.Model Namespace